# ============================ Файл 1: Комплексный радиус робастной устойчивости ============================
import numpy as np
from scipy.linalg import solve_continuous_are

# задаем матрицы семейства
A = np.array([[-1, -2],
              [2, -1]])
B = np.array([[0],
              [1]])
C = np.array([[0, 1]])

# задаем стартовые границы отрезка
a = 1e-3
b = 100.0

# задаем точность
eps = 1e-6

# печать статуса
print(' |-----------------------------------------------|')
print(' |                                               |')
print(' |        ВЫЧИСЛЕНИЕ КОМПЛЕКСНОГО РАДИУСА        |')
print(' |             РОБАСТНОЙ УСТОЙЧИВОСТИ            |')
print(' |                                               |')
print(' |-----|-------------|-------------|-------------|')
print(' | шаг |      a      |      b      |      c      |')

for iter in range(1, 101):
    # находим середину отрезка
    c = 0.5 * (a + b)

    # печать статуса
    print(' |-----|-------------|-------------|-------------|')
    print(f' | {iter:3d} | {a:.5e} | {b:.5e} | {c:.5e} |')

    # формируем матрицы для уравнения Риккати
    Q = C.T @ C
    B1 = B / c                     # чтобы B1*B1' = B*B'/c^2
    R = np.eye(1)

    # находим решение алгебраического H∞-уравнения Риккати
    try:
        X = solve_continuous_are(A, B1, Q, R)
        b = c
    except np.linalg.LinAlgError:
        a = c

    # проверяем критерий останова
    if abs(b - a) < eps:
        break

print(' |-----|-------------|-------------|-------------|\n')